test/solver/incompressibleVoF/cases/vofRow4IsoAdvectorMoving/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Geometric VoF (interIsoFoam) on the oscillating mesh of cases/vofRow4Moving:
// the combination in which the interface velocity has to be made relative to
// the mesh motion, sub-cycled three times per step.
advectionScheme isoAdvector;

solvers
{
    "alpha.water.*"
    {
        // isoAdvector controls, read by Foam::isoAdvection at construction.
        isoFaceTol      1e-6;
        surfCellTol     1e-6;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;
        reconstructionScheme isoAlpha;

        nAlphaSubCycles 3;
        // Unused by isoAdvector, but interfaceProperties reads it at mixture
        // construction, so it must be present.
        cAlpha          1;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    // Switched off so this case exercises the mesh motion on its own, as 9 of
    // the 17 moving tutorials also do; cases/vofRow4MovingCorrectPhi is the
    // twin that asks for the post-move flux projection.
    correctPhi          no;

    // Closed box: every p_rgh patch is zeroGradient, so the pressure needs a
    // reference cell (read by setRefCell under the *p* field's key names).
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}


// ************************************************************************* //
